{
  "Category" : [ null, {
    "mImage" : "ingredientsbaking.jpg",
    "mName" : "Baking Ingredients"
  }, {
    "mImage" : "furniture.jpg",
    "mName" : "Furniture"
  } ],
  "Product" : [ null, {
    "mCategoryID" : "1",
    "mDescription" : "The heart of most baking recipes is flour, popular as all-purpose flour, and locally known as maida. Available as branded packages and sold loose by the kilo in kirana stores and supermarkets. Maida is made by the process of skimming the bran and husk off the wheat flour, taking off the fibre content, leaving you with a fine, smooth flour. Using good quality maida is a must, as it is an important ingredient in your recipe. Many times, maida/all-purpose flour is confused for self-raising flour. While maida is just the flour all by itself, self-raising flour is mixed along with raising agents like baking powder and a dash of salt added to it. Like we all know following the recipe diligently is the key, as baking is a science. Use all-purpose flour as mentioned in your recipes.",
    "mImage" : "1_Flour_Maida_1.jpg",
    "mName" : "All purpose Flour",
    "mPrice" : 123
  }, {
    "mCategoryID" : "1",
    "mDescription" : "Adding richness and texture to our soft, buttery, flaky bakes, be it cakes or pastries like – shortcrust pastries, butter is what brings it all together. Store bought butter works best, be it Amul butter or President butter is great to use. Although unsalted butter works best for bakes, using salted butter doesn’t hurt. The salt present in the butter when added to the recipe, brings out the flavours beautifully.",
    "mImage" : "2_Butter_1.jpg",
    "mName" : "Butter",
    "mPrice" : 234
  }, {
    "mCategoryID" : "1",
    "mDescription" : "Oil is the used many a times, in place of butter, to replace the fat content in the recipe. Oil is used in cakes and sponges, that is light, due to the eggs resent in it, and which don’t want to be pulled down by the heaviness of the butter",
    "mImage" : "3_Oil_1.jpg",
    "mName" : "Oil",
    "mPrice" : 23
  }, {
    "mCategoryID" : "1",
    "mDescription" : "Superfine processed sugar, that has finer granules, works well when combined with butter or eggs. The superfine texture helps give you your desired texture required for the recipe, when compared to the regular sugar crystals that don’t melt easily ruining the composition of the recipe.",
    "mImage" : "4_Castor_Sugar_1.jpg",
    "mName" : "Castor Sugar",
    "mPrice" : 32
  }, {
    "mCategoryID" : "1",
    "mDescription" : "Sugar crystals that are less refined and still have a coating of dark molasses on them is essentially brown sugar. It is best used in tea cakes and cookies, that taste earthy and rustic with the brown sugar flavour and texture.",
    "mImage" : "5_Brown_Sugar_1.jpg",
    "mName" : "Brown Sugar",
    "mPrice" : 54
  }, {
    "mCategoryID" : "1",
    "mDescription" : "Icing sugar is a mixture of powdered sugar along with some cornflour. It is also known as confectioners sugar.  Icing sugar and sugar are often mistaken for each other and can't always be used interchangeably. Icing sugar is used in making butter creams, which help give the frosting a good body and many a times used in cookies, to add to the texture of a crispy- crunchy cookie. ",
    "mImage" : "6_Icing_Sugar_1.jpg",
    "mName" : "Icing Sugar",
    "mPrice" : 65
  }, {
    "mCategoryID" : "1",
    "mDescription" : "A by-product in the process of extracting all the essential elements of a cacao pod, cocoa powder is the last extract of the pod. Cocoa powder is bitter in taste, yet adds flavour and colour to the bake. Available in two variants, light cocoa powder and dark cocoa powder, the only difference is the tint of the cocoa- light or dark, use it based on the recipe you are making and the end result you are looking for. Hershey’s, Cadbury’s are good brands to use.",
    "mImage" : "7_Cocoa_Powder_1.jpg",
    "mName" : "Cocoa powder",
    "mPrice" : 34.99
  }, {
    "mCategoryID" : "1",
    "mDescription" : "An oh so versatile ingredient, chocolate is used in various forms, chocolate chips, chocolate chunks, melted chocolate used in cookies, cakes, pies, tarts. There are two major variants of chocolate: - Compound, is where the cooking chocolate bar is made using oil, as the fat content. - Couverture, is made used pure cocoa butter, making it a complete package of pure edible chocolate made from the cacao pod.s",
    "mImage" : "8_chocolate_1.jpg",
    "mName" : "Chocolate",
    "mPrice" : 34.99
  }, {
    "mCategoryID" : "1",
    "mDescription" : "Rich cooking cream, with high-fat content is required to bring out the best from the recipe in which cream is used. Cooking cream is different from whipping cream. Cooking cream is a dairy-based product with 25% of fat. Amul cream is a popular brand that holds good in almost all recipes. Used in cheesecakes, custards, ganache and the like.Whipping Cream is usually a non-dairy one, where the cream is essentially made of a soy base. The fat content of the whipping cream used should be more than 30% to give you the fluffy whipped cream. Whipping cream is used to frost cakes, used in eggless desserts and as toppings to serve some of the desserts. This cream is usually a non-dairy one, where the cream is essentially made of a soy base. The fat content of the whipping cream used should be more than 30% to give you the fluffy whipped cream. Whipping cream is used to frost cakes, used in eggless desserts and as toppings to serve some of the desserts.",
    "mImage" : "9_Fresh_Cream_1.jpg",
    "mName" : "Thick Heavy Cream/Cooking cream",
    "mPrice" : 22.99
  }, {
    "mCategoryID" : "1",
    "mDescription" : "The liquid ingredient, that gives you the perfect consistency to your recipe, like that of cake batters or brings moisture to the dish like that of short crust pastry. Using whole milk for baking is always a good idea. Milk is also used to wash breads and pies instead of eggs, for eggless recipes.",
    "mImage" : "10_Milk_1.jpg",
    "mName" : "Milk",
    "mPrice" : 12.99
  }, {
    "mCategoryID" : "1",
    "mDescription" : "Yogurt is many a times used as a substitute for eggs in a particular recipe to make an eggless version. It is also added to baking recipes, to bring up the level of acidity required in a recipe to react with the baking soda for leavening. Yogurt and buttermilk make the bakes moist, and tender. It maintains the moisture level even after the goods are baked. They enhance the texture of the bakes, giving it a lovely velvety mouthfeel. ",
    "mImage" : "11_Curd_1.jpg",
    "mName" : "Yogurt/ Butter Milk",
    "mPrice" : 100.99
  }, {
    "mCategoryID" : "1",
    "mDescription" : "Whole milk, reduced and sweetened, Condensed milk, is absolutely thick and yummy, that is available in tins, popular from the brands called Nestle Milkmaid and Amul Mithaimate. It is used to sweetener recipes, as well as improvise on the texture. Many times, it is used as a substitute in eggless recipes.",
    "mImage" : "12_Condensed_Milk_1.jpg",
    "mName" : "Condensed Milk",
    "mPrice" : 111.99
  }, {
    "mCategoryID" : "1",
    "mDescription" : "Natural raising agent, eggs not only add volume to the recipe, the yolks add richness to the recipe. Its always a better idea to use pasteurized packaged eggs, as they are better in quality and enhance your product.",
    "mImage" : "13_Eggs_1.jpg",
    "mName" : "Eggs",
    "mPrice" : 23.99
  }, {
    "mCategoryID" : "1",
    "mDescription" : "An alternative to eggs, to make your recipes vegetarian or vegan. This healthy replacement, ensures the recipe turns out just as well as it would with eggs. Flax seeds are ground long with water in a predetermined proportion, rested and used in the recipe. Things couldn’t get easier than this.",
    "mImage" : "14_Flaxseed_Egg_Replace_for_Vegan_Eggless_Baking_1_2.jpg",
    "mName" : "Flax meal egg replacer",
    "mPrice" : 95.0
  }, {
    "mCategoryID" : "1",
    "mDescription" : "They are both leavening agents, while baking soda is just baking soda by itself, baking powder has baking soda and cream of tartar mixed in it. They both have unique roles and are used differently in different recipes.",
    "mImage" : "15_Baking_Powder_1.jpg",
    "mName" : "Baking Powder and Baking Soda",
    "mPrice" : 23
  }, {
    "mCategoryID" : "1",
    "mDescription" : "Salt is added to baking recipes, to enhance the other flavours present in the recipes. Salt helps balance the sweetness in cake batters or cookie doughs. A pinch of it is all you need in sweet bakes. In breads, and savoury bakes, salt is not just added for taste but it also helps control the rate at which the yeast grows when combined with flour in a recipe.",
    "mImage" : "16_IMG_3429.jpg",
    "mName" : "Salt",
    "mPrice" : 64
  }, {
    "mCategoryID" : "1",
    "mDescription" : "Various kinds of flavouring agents are used in baking, from, the most popular one being Vanilla Essence, and other agents like Extract, which is often a pure extract from the fresh ingredient. Other flavouring includes, fresh lemon zest or orange zest. Whole spices, lend great aroma to the dish, like cinnamon, star anise, nutmeg to name a few. ",
    "mImage" : "17_Vanila_Spices_Orange_Flavouring_Agents_1.jpg",
    "mName" : "Vanilla Extracts/ Essences",
    "mPrice" : 66
  }, {
    "mCategoryID" : "2",
    "mDescription" : "Baking is all about precision, so having a full set of measuring cups and spoons on hand is a must. Don’t think you can get by with just one type of measuring cup—you’ll need both dry and wet measuring cups to accurately measure all your ingredients for pretty much any baking recipe. Keep these tools in an easy-to-reach spot, because you’ll use them all the time.",
    "mImage" : "1_Measuring_Cups.jpg",
    "mName" : "Measuring Cups",
    "mPrice" : 123
  }, {
    "mCategoryID" : "2",
    "mDescription" : "One wooden spoon is enough, but this tool is so handy, it can sometimes be helpful to have a couple around. Wooden spoons are great for all kinds of stirring because they’re so sturdy (you’ll be able to use them with even the thickest, heaviest doughs). Just remember to hand-wash them when you’re done so they don’t end up cracked.",
    "mImage" : "2_Wooden_Spoon.jpg",
    "mName" : "Wooden Spoon",
    "mPrice" : 211
  }, {
    "mCategoryID" : "2",
    "mDescription" : "We’re willing to bet you reach for your rubber scraper more often than you think. This tool is ideal for scraping the last bit of batter or dough out of a pan or for scraping all the nooks and crannies of a jar. They’re also super handy for folding together wet and dry ingredients. Just keep in mind that silicone scrapers will stand up to high heat better than rubber.",
    "mImage" : "3_Rubber_Spatula.jpg",
    "mName" : "Rubber Spatula/Scraper",
    "mPrice" : 233
  }, {
    "mCategoryID" : "2",
    "mDescription" : "When you need to transfer fresh-out-of-the-oven cookies to a cooling rack or serve a piece of cake from a 9x13 pan, there’s no tool better than a good old spatula. Having one with a thin metal blade can be especially handy—it’ll be flexible enough to easily slide under anything you’re moving without squishing the dough or crumbling your cookies.",
    "mImage" : "4_Metal_Spatula.jpg",
    "mName" : "Spatula/Metal Turner",
    "mPrice" : 254
  }, {
    "mCategoryID" : "2",
    "mDescription" : "This handy tool has more uses than you realized. It can be used to grease a pan before pouring in cake batter, to coat dough with melted butter or egg wash, or to “paint” milk on top of a piecrust. Especially if you’re a frequent baker, this is a must-have!",
    "mImage" : "5_Pastry_Brush.jpg",
    "mName" : "Pastry Brush",
    "mPrice" : 321
  }, {
    "mCategoryID" : "2",
    "mDescription" : "Sure, you can use a wire whisk to beat together a few eggs, but it’s handy for other things too. In particular, it’s one of the best ways to thoroughly mix together dry ingredients and is also great for stirring together a homemade custard.",
    "mImage" : "6_Whisk.jpg",
    "mName" : "Whisk",
    "mPrice" : 311
  }, {
    "mCategoryID" : "2",
    "mDescription" : "Whenever we’re making a recipe, baking or otherwise, we always our have our kitchen shears handy. They can be useful in so many different ways: Snipping fresh herbs, cutting parchment to fit a pan, and even just opening stubborn packages and containers.",
    "mImage" : "7_Kitchen_Scissors.jpg",
    "mName" : "Kitchen Scissors",
    "mPrice" : 300
  }, {
    "mCategoryID" : "2",
    "mDescription" : "Rolling pins are definitely the most useful for rolling out piecrusts, cookie dough, and puff pastry, but there are other ways you can put this tool to work in your kitchen. For example, if you don’t have a food processor and need to crush cookies, chips, or crackers for a recipe, just put them in a sealable bag, then use your rolling pin to smash them to pieces.",
    "mImage" : "8_Rolling_Pin.jpg",
    "mName" : "Rolling Pin",
    "mPrice" : 450
  }, {
    "mCategoryID" : "2",
    "mDescription" : "You can put a sieve to work in a lot of different ways. For bakers, it’s probably the most useful for sifting dry ingredients or adding a dusting of powdered sugar to a finished pan of brownies or cookies. It also comes in handy for draining wet ingredients (especially small ones,like quinoa, that would slip through a regular colander).",
    "mImage" : "9_Fine_Mesh_Siev.jpg",
    "mName" : "Fine-Mesh Sieve",
    "mPrice" : 555
  }, {
    "mCategoryID" : "2",
    "mDescription" : "If you have only one knife in your whole kitchen, make it this one. This all-purpose knife is great for slicing, dicing, chopping, and mincing just about any ingredient your recipe calls for.",
    "mImage" : "10_Chef_Knife.jpg",
    "mName" : "Chef's Knife",
    "mPrice" : 666
  }, {
    "mCategoryID" : "2",
    "mDescription" : "Yes, make sure you have this smallest knife in your drawer. It’s great for peeling and coring foods like apples, so you’ll need one on hand—especially if you ever make an apple pie. It’s also handy for cutting up other fruits and veggies, and for more delicate work that your chef’s knife is too big for.",
    "mImage" : "11_Paring_Knife.jpg",
    "mName" : "Paring Knife",
    "mPrice" : 210
  }, {
    "mCategoryID" : "2",
    "mDescription" : "A regular baking pan (13x9x2 inches) is a definite must-have. You can use it for so many sweet things—cakes, brownies, cookie bars—and, of course, it has a few savory uses as well. If you pick only one baking pan to stock your kitchen with, make it this one.",
    "mImage" : "12_Rectangular_Baking_Pan.jpg",
    "mName" : "Rectangular Baking Pan",
    "mPrice" : 150
  }, {
    "mCategoryID" : "2",
    "mDescription" : "Really, you should have two of these on hand, because you’ll need more than one to make a stunning, towering layer cake. Round cake pans come in 8-inch and 9-inch diameters, but most layer cake recipes will work with either size (just make sure you have two of the same size).",
    "mImage" : "13_Round_Cake_Pan.jpg",
    "mName" : "Round Cake Pan",
    "mPrice" : 150
  }, {
    "mCategoryID" : "2",
    "mDescription" : "Banana bread, pumpkin bread, zucchini bread—all of our favorite homemade bread recipes call for a loaf pan. If you want to bake your own yeast bread, too, it’ll pay off to have two of these pans in your cupboard.",
    "mImage" : "14_Loaf_Pan.jpg",
    "mName" : "Loaf Pan",
    "mPrice" : 150
  }, {
    "mCategoryID" : "2",
    "mDescription" : "Yes, the most obvious use for a pie plate is baking your own homemade pies, but there are a lot of other desserts that make this pan useful to have around. Also, you can make savory pies like meatball pie and taco pie for dinner, plus some frozen icebox pies as well.",
    "mImage" : "15_Pie_Plate.jpg",
    "mName" : "Pie Plate",
    "mPrice" : 105.99
  }, {
    "mCategoryID" : "2",
    "mDescription" : "You don’t always need to make a huge pan of brownies, and when you just want a small batch, you’ll need a square baking pan. Cookie bars, cakes, brownies, and corn bread are just a few of the baked goods you can serve up from an 8x8 or 9x9 pan.",
    "mImage" : "16_Square_Baking_Pan.jpg",
    "mName" : "Square Baking Pan",
    "mPrice" : 120
  }, {
    "mCategoryID" : "2",
    "mDescription" : "No one wants soggy, overbaked cookies and cakes for dessert, so make sure you’ve got a wire rack on hand in your kitchen. This handy tool allows air to circulate around baked goods as they cool, so they’ll taste just as great at room temperature as they did fresh out of the oven.",
    "mImage" : "17_Wire_Rack.jpg",
    "mName" : "Wire Rack",
    "mPrice" : 142
  }, {
    "mCategoryID" : "2",
    "mDescription" : "Use this pan to show up at your next brunch with a tray of freshly baked muffins, or use it to make cupcakes for your next birthday celebration. Plus, you can use a muffin pan for lots of different savory recipes too, like meatballs, pizza cups, and mini meat loaves.",
    "mImage" : "18_Muffin_Pan.jpg",
    "mName" : "Muffin Pan",
    "mPrice" : 112
  }, {
    "mCategoryID" : "2",
    "mDescription" : "You definitely need at least one cookie sheet in your kitchen, and you’ll probably benefit from having two. Of course, this pan is essential for baking pretty much any kind of cookie, but you can use it for tons of other sheet pan dinner recipes, too.",
    "mImage" : "19_Cookie_Sheet.jpg",
    "mName" : "Cookie Sheet",
    "mPrice" : 50
  }, {
    "mCategoryID" : "2",
    "mDescription" : "While you don’t need to go all-out on a fancy stand mixer, you do need at least a hand mixer in your arsenal of baking tools. It makes mixing up doughs and batters much easier and quicker, and it’s by far the best way to mix ingredients into a thick, stiff cookie dough without tiring out your arm.",
    "mImage" : "20_Hand_Mixer.jpg",
    "mName" : "Hand Mixer/Stand Mixer",
    "mPrice" : 1000
  }, {
    "mCategoryID" : "2",
    "mDescription" : "If you haven’t been baking with parchment paper, start now! Spreading a sheet over your pan before you start baking cookies will make clean-up much easier and prevent your baked goods from sticking to the pan. You can also opt for pricier reusable silicone baking mats, but parchment paper is more affordable and will work just as well.",
    "mImage" : "21_Parchment_Paper.jpg",
    "mName" : "Parchment Paper",
    "mPrice" : 40
  }, {
    "mCategoryID" : "2",
    "mDescription" : "If you’re big on baking pies and biscuits, this is a handy tool to have—it’ll make cutting cold butter or shortening into flour much easier. But if you don’t have one in your kitchen, you can use two butter knives instead. Just move the knives in a crisscross motion to cut the butter into the flour.",
    "mImage" : "22_Pastry_Blender.jpg",
    "mName" : "Pastry Blender",
    "mPrice" : 100
  } ],
  "Requests" : {
    "-MCW6u6op4UeCUopeMMT" : {
      "mDateOrder" : "18/07/2020 15:52:09",
      "mOrders" : [ {
        "mPrice" : 123,
        "mProductId" : "18",
        "mProductName" : "Measuring Cups",
        "mQuantity" : 2
      } ],
      "mPaymentMethod" : "Cash on Delivery (COD)",
      "mPhoneUser" : "0387741552",
      "mShippingToAddress" : "Tay Ninh",
      "mShippingToFullname" : "Minh Khoi",
      "mShippingToPhone" : "0387741552",
      "mStatus" : "Shipping",
      "mTotal" : 246
    },
    "-MCWI8U-7fChvyYBrxKi" : {
      "mDateOrder" : "18/07/2020 16:41:16",
      "mOrders" : [ {
        "mPrice" : 123,
        "mProductId" : "1",
        "mProductName" : "All purpose Flour",
        "mQuantity" : 3
      }, {
        "mPrice" : 233,
        "mProductId" : "20",
        "mProductName" : "Rubber Spatula/Scraper",
        "mQuantity" : 2
      } ],
      "mPaymentMethod" : "Cash on Delivery (COD)",
      "mPhoneUser" : "0834116999",
      "mShippingToAddress" : "Nam Dinh",
      "mShippingToFullname" : "Duc Chien",
      "mShippingToPhone" : "0834116999",
      "mStatus" : "Place",
      "mTotal" : 835
    },
    "-MCWbWnZemOgKYvE2MwU" : {
      "mDateOrder" : "18/07/2020 18:10:18",
      "mOrders" : [ {
        "mPrice" : 123,
        "mProductId" : "1",
        "mProductName" : "All purpose Flour",
        "mQuantity" : 4
      }, {
        "mPrice" : 234,
        "mProductId" : "2",
        "mProductName" : "Butter",
        "mQuantity" : 2
      } ],
      "mPaymentMethod" : "Credit Card",
      "mPhoneUser" : "0387741552",
      "mShippingToAddress" : "Tay Ninh",
      "mShippingToFullname" : "Minh Khoi",
      "mShippingToPhone" : "0387741552",
      "mStatus" : "Place",
      "mTotal" : 960
    },
    "-MCwso26YIHE5z3eU6vd" : {
      "mDateOrder" : "24/07/2020 01:15:34",
      "mOrders" : [ {
        "mPrice" : 234,
        "mProductId" : "2",
        "mProductName" : "Butter",
        "mQuantity" : 1
      }, {
        "mPrice" : 450,
        "mProductId" : "25",
        "mProductName" : "Rolling Pin",
        "mQuantity" : 1
      }, {
        "mPrice" : 22.99,
        "mProductId" : "9",
        "mProductName" : "Thick Heavy Cream/Cooking cream",
        "mQuantity" : 1
      } ],
      "mPaymentMethod" : "Cash on Delivery (COD)",
      "mPhoneUser" : "0387741552",
      "mShippingToAddress" : "Tay Ninh",
      "mShippingToFullname" : "Minh Khoi",
      "mShippingToPhone" : "0387741552",
      "mStatus" : "Place",
      "mTotal" : 706.99
    },
    "-MCyX8QGQZYmHTa9KPAa" : {
      "mDateOrder" : "24/07/2020 08:55:46",
      "mOrders" : [ {
        "mPrice" : 123,
        "mProductId" : "1",
        "mProductName" : "All purpose Flour",
        "mQuantity" : 2
      }, {
        "mPrice" : 32,
        "mProductId" : "4",
        "mProductName" : "Castor Sugar",
        "mQuantity" : 2
      } ],
      "mPaymentMethod" : "Cash on Delivery (COD)",
      "mPhoneUser" : "0834116999",
      "mShippingToAddress" : "Nam Dinh",
      "mShippingToFullname" : "Duc Chien",
      "mShippingToPhone" : "0834116999",
      "mStatus" : "Shipping",
      "mTotal" : 310
    },
    "-MCy_YnZpGc12af7L3nb" : {
      "mDateOrder" : "24/07/2020 09:10:41",
      "mOrders" : [ {
        "mPrice" : 32,
        "mProductId" : "4",
        "mProductName" : "Castor Sugar",
        "mQuantity" : 3
      }, {
        "mPrice" : 233,
        "mProductId" : "20",
        "mProductName" : "Rubber Spatula/Scraper",
        "mQuantity" : 1
      } ],
      "mPaymentMethod" : "Cash on Delivery (COD)",
      "mPhoneUser" : "0387741552",
      "mShippingToAddress" : "Tay Ninh",
      "mShippingToFullname" : "Minh Khoi",
      "mShippingToPhone" : "0387741552",
      "mStatus" : "Place",
      "mTotal" : 329
    },
    "-MCymOkMpBi6ljLwFfaO" : {
      "mDateOrder" : "24/07/2020 10:06:47",
      "mOrders" : [ {
        "mPrice" : 123,
        "mProductId" : "1",
        "mProductName" : "All purpose Flour",
        "mQuantity" : 1
      } ],
      "mPaymentMethod" : "Cash on Delivery (COD)",
      "mShippingToAddress" : "TN",
      "mShippingToFullname" : "MK",
      "mShippingToPhone" : "0387741556",
      "mStatus" : "Place",
      "mTotal" : 123
    },
    "-MD-OgaU5w1VYjJrBKPu" : {
      "mDateOrder" : "24/07/2020 17:38:06",
      "mOrders" : [ {
        "mPrice" : 123,
        "mProductId" : "1",
        "mProductName" : "All purpose Flour",
        "mQuantity" : 4
      }, {
        "mPrice" : 54,
        "mProductId" : "5",
        "mProductName" : "Brown Sugar",
        "mQuantity" : 2
      }, {
        "mPrice" : 234,
        "mProductId" : "2",
        "mProductName" : "Butter",
        "mQuantity" : 1
      } ],
      "mPaymentMethod" : "Cash on Delivery (COD)",
      "mShippingToAddress" : "TN",
      "mShippingToFullname" : "khoi",
      "mShippingToPhone" : "0387741552",
      "mStatus" : "Place",
      "mTotal" : 834
    },
    "-MD-Qou6j5pzSt2ehnqX" : {
      "mDateOrder" : "24/07/2020 17:47:24",
      "mOrders" : [ {
        "mPrice" : 32,
        "mProductId" : "4",
        "mProductName" : "Castor Sugar",
        "mQuantity" : 1
      } ],
      "mPaymentMethod" : "Cash on Delivery (COD)",
      "mPhoneUser" : "0387741552",
      "mShippingToAddress" : "Tay Ninh",
      "mShippingToFullname" : "Minh Khoi",
      "mShippingToPhone" : "0387741552",
      "mStatus" : "Place",
      "mTotal" : 32
    },
    "-MD-RLMlxiPT1P_Ul3Ho" : {
      "mDateOrder" : "24/07/2020 17:49:41",
      "mOrders" : [ {
        "mPrice" : 1000,
        "mProductId" : "37",
        "mProductName" : "Hand Mixer/Stand Mixer",
        "mQuantity" : 1
      } ],
      "mPaymentMethod" : "Credit Card",
      "mPhoneUser" : "0387741552",
      "mShippingToAddress" : "Tay Ninh",
      "mShippingToFullname" : "Minh Khoi",
      "mShippingToPhone" : "0387741552",
      "mStatus" : "Place",
      "mTotal" : 1000
    },
    "-MD1SAoInBTxr8LIYuJv" : {
      "mDateOrder" : "25/07/2020 03:12:34",
      "mOrders" : [ {
        "mPrice" : 254,
        "mProductId" : "21",
        "mProductName" : "Spatula/Metal Turner",
        "mQuantity" : 1
      } ],
      "mPaymentMethod" : "Cash on Delivery (COD)",
      "mShippingToAddress" : "ghshsh",
      "mShippingToFullname" : "hhggsggs",
      "mShippingToPhone" : "1234567890",
      "mStatus" : "Place",
      "mTotal" : 254
    },
    "-MDNIb4TEa-nZ62shKd_" : {
      "mDateOrder" : "29/07/2020 09:02:23",
      "mOrders" : [ {
        "mPrice" : 123,
        "mProductId" : "1",
        "mProductName" : "All purpose Flour",
        "mQuantity" : 1
      } ],
      "mPaymentMethod" : "Cash on Delivery (COD)",
      "mPhoneUser" : "0986710392",
      "mShippingToAddress" : "Tay Ninh",
      "mShippingToFullname" : "minh khoi",
      "mShippingToPhone" : "0986710392",
      "mStatus" : "Place",
      "mTotal" : 123
    },
    "-MDNy1N7KIBzbCyRwPvO" : {
      "mDateOrder" : "29/07/2020 12:07:45",
      "mOrders" : [ {
        "mPrice" : 123,
        "mProductId" : "1",
        "mProductName" : "All purpose Flour",
        "mQuantity" : 1
      } ],
      "mPaymentMethod" : "Cash on Delivery (COD)",
      "mShippingToAddress" : "tay ninh",
      "mShippingToFullname" : "minh khoi",
      "mShippingToPhone" : "0387741552",
      "mStatus" : "Place",
      "mTotal" : 123
    }
  },
  "Users" : {
    "0387741552" : {
      "mAddress" : "Tay Ninh",
      "mDOB" : "9/6/1998",
      "mEmail" : "khoibmhe141771@fpt.com.vn",
      "mFullName" : "Minh Khoi",
      "mGender" : false,
      "mPassword" : "12345678",
      "mPhone" : "0387741552"
    },
    "0387741554" : {
      "mFullName" : "minh khoi",
      "mGender" : false,
      "mPassword" : "123456789",
      "mPhone" : "0387741554"
    },
    "0834116999" : {
      "mAddress" : "Nam Dinh",
      "mDOB" : "15/10/1999",
      "mEmail" : "chientdhe130327@fpt.edu.vn",
      "mFullName" : "Duc Chien",
      "mGender" : true,
      "mPassword" : "12345678",
      "mPhone" : "0834116999"
    },
    "0986710392" : {
      "mAddress" : "Tay Ninh",
      "mDOB" : "29/1/2000",
      "mEmail" : "minhkhoi.mike@gmail.com",
      "mFullName" : "minh khoi",
      "mGender" : true,
      "mPassword" : "12345678",
      "mPhone" : "0986710392"
    }
  }
}
